{
  "main": {
    "name": "Breahem Bedi",
    "occupation": "Computer Science Graduate Student,",
    "description": "who is looking for a software engineering job to kick start my career in the IT industry",
    "image": "profilepic.jpg",
    "bio": "Since I was young, I was always fascinated by the day-to-day evolving technology. During high school, I came across an opportunity to pick up programming as a elective, which by far turned out to be the most fun subject. I loved making the programs work the way I wanted to and coming up with fun and creative designs for the front end of my applications. Since then, I have had a growing interest in software engineering, digital designing and learning new ways to code to create new applications. I have always enjoyed learning new things and am constantly seeking out new learning opportunities. My biggest ambition is to one day have a chance to work on an application that will make a big diffrence in the future.",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "lovelybedi@hotmail.com",
    "phone": "0226778982",
    "address": {
      "street": "Margaret Street, Papakura",
      "city": "Auckland",
      "state": "New Zealand",
      "zip": "2110"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "Breahem Bedi CV-Updated.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/BreahemBedi/",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "http://twitter.com",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/breahem-bedi",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "http://github.com/Breahem-Bedi",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm a tinkerer and am always interested in playing around with new technologies but these are the ones that have really won me over",
    "education": [
      {
        "school": "Auckland University of Technology",
        "degree": "Bachelor of Computer & Information Sciences",
        "graduated": "March 2021",
        "description": "Double Majored in Computer Science and Software Development. It was here that I discovered my passion for front end development and found that I have a knack for creating awesome front-end designs and applications."
      },
      {
        "school": "Papatoetoe High School",
        "degree": "NCEA Level 3",
        "graduated": "October 2016",
        "description": "During high school, I came across an opportunity to pick up programming as a elective, which by far turned out to be the most fun subject. I loved making the programs work the way I wanted to and coming up with fun and creative designs for my python applications. Since then, I have had a growing interest in software engineering, digital designing and learning new ways to code to create new applications."
      }
    ],
    "work": [
      {
        "company": "Westbourne IT Global Services",
        "title": "Software Developer",
        "years": "February 2019 - November 2019",
        "description": "Year long project consisted of developing an AI Help-Desk for the client at Westbourne IT Global Services. The client had requested the implementation of a chatbot, that is to be able to respond to simple IT queries that its potential users may inquire about."
      },
      {
        "company": "Restaurent Brands",
        "title": "Star Crew Member",
        "years": "February 2017 - Present",
        "description": "Delivering of excellent customer experience, helping customers choose the right product and/or service for their requirements. Conducting problem solving and troubleshooting. Assisted in training new staff members. Developed a number of incentives for team members to achieve targets."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Photoshop",
        "level": "75%"
      },
      {
        "name": "Illustrator",
        "level": "65%"
      },
      {
        "name": "ReactJs",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "60%"
      },
      {
        "name": "HTML5",
        "level": "50%"
      },
      {
        "name": "Firebase",
        "level": "50%"
      },
      {
        "name": "MongoDB",
        "level": "50%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Netflix",
        "category": "A Netflix clone made using styled components and firebase (firestore & auth).",
        "image": "netflix2.png",
        "url": "https://netflix-clone-8e147.web.app"
      },
      {
        "title": "Seer",
        "category": "When you need to verify a software engineering claim, we are your curated evidence repository.",
        "image": "seer3.png",
        "url": "https://seer-repo.herokuapp.com/"
      },
      {
        "title": "Amazon",
        "category": "A Full-Stack Amazon Clone, with Full E-Comm Store and Stripe.js functionality that handles real payments in the project.",
        "image": "amazon3.png",
        "url": "https://clone-466e7.web.app/"
      },
      {
        "title": "COVID-19 Tracker",
        "category": "COVID-19 Tracker React App.",
        "image": "covid3.png",
        "url": "https://covid-19-tracking-app-a78bd.web.app/"
      },
      {
        "title": "Slack",
        "category": "Slack Clone with working channels using the firestore db.",
        "image": "slack5.png",
        "url": "https://slack-clone-d93f7.web.app/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I have had the opportunity to work with Breahem on multiple occasions which has always been a pleasure. He is driven and motivated with a consistently positive attitude. Breahem excels at communicating with others and is always willing to work hard until he solves the problem at hand.",
        "user": "Luis Hojin Ko"
      },
      {
        "text": "That Breahem Bedi must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Rayhaan Mohammad"
      }
    ]
  }
}
